In [1]:
import numpy as np
import pandas as pd

import json as json

In [2]:
all_counts_dataframe = pd.read_csv("results_data/rewiring_edges_agreement.csv")

In [38]:
all_counts_dataframe = all_counts_dataframe.applymap(lambda x: list(map(float, x.split("[")[1].split(']')[:-1][0].split(','))))

## Taking Mean over results

In [39]:
all_counts_dataframe.applymap(lambda x: np.mean(x))

       Texas    Cornell
0  74.259259  66.666667
1  60.185185  66.666667
2  67.222222  66.666667
3  34.074074  66.666667
4   3.333333  66.666667

## Taking Std over results

In [41]:
all_counts_dataframe.applymap(lambda x: np.std(x))

       Texas    Cornell
0   3.218175  23.570226
1  10.718368  23.570226
2   6.136312  23.570226
3  11.700421  23.570226
4   4.714045  23.570226